Autodesk.Revit.DB.KeyBasedTreeEntries.FindEntry(System.String)
Finds the KeyBasedTreeEntry associated with the given key value.
Remarks:
If no matching KeyBasedTreeEntry can be found, null will be returned;
The given key value cannot be an empty string.
key:
The specified key value.
Returns:
The KeyBasedTreeEntry corresponds to the given key value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
key is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015